#ifndef USER_H__
#define USER_H__

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

#include "SkillDelay.h"
#include "ComboAttack.h"
#include "giocp.h"
#include "..\ggsvr\ggsvr.h"
#include "MagicInf.h"
#include "..\common\zzzitem.h"
#include "..\common\classdef.h"
#include "GuildClass.h"
#include "TDurMagicKeyChecker.h"
#include "TMonsterAIAgro.h"
#include "TMonsterSkillElementInfo.h"
#include "JewelOfHarmonySystem.h"
#include "ItemSystemFor380.h"
#include "BuffEffect.h"
#include "HackToolPacket.h"
#include "PCBangPointSystem.h"
#include "SocketOption.h"
#include "StdAfx.h"

//#define OBJMAX 11000
//#define OBJMAXUSER 1000
//#define OBJ_MAXMONSTER 9400

#define OBJMAX						12500
#define OBJMAXUSER					1000
#define OBJ_MAXMONSTER				10500

#define CRYWOLF_MAP_RANGE(map) ( ( ((map)) == MAP_INDEX_CRYWOLF_FIRSTZONE  )?TRUE:FALSE  )

#define OBJ_STARTUSERINDEX (OBJMAX - OBJMAXUSER)
#define OBJ_CALLMONCOUNT (OBJ_STARTUSERINDEX - OBJ_MAXMONSTER)
#define MAX_MONSTER_SEND_MSG	100//10
#define MAX_MONSTER_SEND_ATTACK_MSG	500//50
#define MAX_MONSTER_TYPE 1000//512
#define MAX_GUILD_LEN 8
#define MAX_ACCOUNT_LEN 10
#define INVENTORY_SIZE 108
#define WAREHOUSE_SIZE 120
#define TRADE_BOX_SIZE 32
#define MAGIC_SIZE 60
#define INVETORY_WEAR_SIZE	12
#define INVENTORY_BAG_START INVETORY_WEAR_SIZE
#define MAIN_INVENTORY_SIZE 76
#define INVENTORY_MAP_SIZE 96
#define TRADE_BOX_MAP_SIZE 32
#define PSHOP_SIZE 32
#define PSHOP_MAP_SIZE 32
#define MAX_CHAR_LEVEL	400

#define OBJMAX_RANGE(aIndex) ( ((aIndex) < 0 )?FALSE:( (aIndex) > OBJMAX-1 )?FALSE:TRUE   )
#define FRIEND_SERVER_STATE_LOGIN_FAIL	0
#define FRIEND_SERVER_STATE_OFFLINE		1
#define FRIEND_SERVER_STATE_ONLINE		2

#define MAIN_INVENTORY_RANGE(x) (((x)<0)?FALSE:((x)>MAIN_INVENTORY_SIZE-1)?FALSE:TRUE )
#define INVENTORY_RANGE(x) (((x)<0)?FALSE:((x)>INVENTORY_SIZE-1)?FALSE:TRUE )
#define WAREHOUSE_RANGE(x) (((x)<0)?FALSE:((x)>WAREHOUSE_SIZE-1)?FALSE:TRUE )
#define TRADE_BOX_RANGE(x) (((x)<0)?FALSE:((x)>TRADE_BOX_SIZE-1)?FALSE:TRUE )
#define OBJMON_RANGE(x) ( ((x)<0)?FALSE:((x)>OBJ_MAXMONSTER-1)?FALSE:TRUE)
#define PSHOP_RANGE(x) ( (((x)-MAIN_INVENTORY_SIZE)<0)?FALSE:(((x)-MAIN_INVENTORY_SIZE)>(INVENTORY_SIZE-MAIN_INVENTORY_SIZE-1))?FALSE:TRUE )
#define ATTRIBUTE_RANGE(x) (((x)<51)?FALSE:((x)>58)?FALSE:TRUE )

#define CURRENT_DB_VERSION	3

#define CHAR_SET_SIZE		18

#define CS_CLASS		0

#define CS_WEAPON1_TYPE	1
#define CS_WEAPON2_TYPE	2

#define CS_WEAPON1_DATA	12
#define CS_WEAPON2_DATA	13

#define CS_HELMET1		13
#define CS_HELMET2		9
#define CS_HELMET3		3

#define CS_ARMOR1		14
#define CS_ARMOR2		9
#define CS_ARMOR3		3

#define CS_PANTS1		14
#define CS_PANTS2		9
#define CS_PANTS3		4

#define CS_GLOVES1		15
#define CS_GLOVES2		9
#define CS_GLOVES3		4

#define CS_BOOTS1		15
#define CS_BOOTS2		9
#define CS_BOOTS3		5

#define CHECK_LIMIT(value, limit) ( ((value)<0)?FALSE:((value)>((limit)-1))?FALSE:TRUE  )
#define CHECK_CLASS(value, type) ( ((value)!=(type))?FALSE:TRUE )

#define CS_GET_CLASS(x) ( (x) <<5 ) & 0xE0

#define CS_GET_CHANGEUP(x) ( ((x)&0x07) )
#define CS_SET_CLASS(x) ( ((x)<<5)& 0xE0 )
#define CS_SET_CHANGEUP(x) ( ((x) << 4) & 0x10 )
#define CS_SET_3RD_CHANGEUP(x) ( ((x) << 3) & 8 )

#define CS_SET_HELMET1(x) ( ((x) & 0x1E0) >> 5 )
#define CS_SET_HELMET2(x) ( ((x) & 0x10 ) << 3 )
#define CS_SET_HELMET3(x) ( ((x) & 0x0F ) << 4 )

#define CS_SET_ARMOR1(x) ( ((x) & 0x1E0) >> 1 )
#define CS_SET_ARMOR2(x) ( ((x) & 0x10 ) << 2 )
#define CS_SET_ARMOR3(x) ( ((x) & 0x0F )      )

#define CS_SET_PANTS1(x) ( ((x) & 0x1E0) >> 5 )
#define CS_SET_PANTS2(x) ( ((x) & 0x10 ) << 1 )
#define CS_SET_PANTS3(x) ( ((x) & 0x0F ) << 4 )

#define CS_SET_GLOVES1(x) ( ((x) & 0x1E0) >> 1 )
#define CS_SET_GLOVES2(x) ( ((x) & 0x10 )      )
#define CS_SET_GLOVES3(x) ( ((x) & 0x0F )      )

#define CS_SET_BOOTS1(x) ( ((x) & 0x1E0) >> 5 )
#define CS_SET_BOOTS2(x) ( ((x) & 0x10 ) >> 1 )
#define CS_SET_BOOTS3(x) ( ((x) & 0x0F ) << 4 )

#define CS_SET_WING1(x)  ( ((x) & 0x03 ) << 2 )
#define CS_SET_HELPER(x) ( ((x) & 0x03 )      )

#define CS_SET_SMALLLEVEL_RH(x)		( (x)       )
#define CS_SET_SMALLLEVEL_LH(x)		( (x) << 3  ) 
#define CS_SET_SMALLLEVEL_HELMET(x)	( (x) << 6  )
#define CS_SET_SMALLLEVEL_ARMOR(x)	( (x) << 9  )
#define CS_SET_SMALLLEVEL_PANTS(x)	( (x) << 12 )
#define CS_SET_SMALLLEVEL_GLOVES(x)	( (x) << 15 )
#define CS_SET_SMALLLEVEL_BOOTS(x)	( (x) << 18 )

#define CS_SET_SMALLLEVEL1(x)		( ((x) >> 16) & 0xFF )
#define CS_SET_SMALLLEVEL2(x)		( ((x) >> 8 ) & 0xFF )
#define CS_SET_SMALLLEVEL3(x)		((x) & 0xFF )

#include "ViewPortGuild.h"

typedef union tagPATHTABLE
{
	short sPathTable[16];
	char cPathTable[32];
} PATHTABLE, * LPPATHTABLE;

typedef struct tagActionState
{
	DWORD Rest:1;	// 0
	DWORD Attack:1;	// 1
	DWORD Move:1;	// 2
	DWORD Escape:1;	// 3
	DWORD Emotion:4;	// 4
	DWORD EmotionCount:8;	// 8

} ACTION_STATE, * LPACTION_STATE;

typedef struct tagInterfaceState
{
	DWORD use	: 2;
	DWORD state : 4;
	DWORD type	: 10;

} INTERFACE_STATE, * LPINTERFACE_STATE;

extern short RoadPathTable[MAX_ROAD_PATH_TABLE];
extern int  gServerMaxUser;	
extern BOOL g_EnergyCheckOff;

struct HITDAMAGE_STRUCT
{
	short number;	// 0
	int HitDamage;	// 4
	DWORD LastHitTime;	// 8
};

struct VIEWPORT_STRUCT
{
	char state;	// 0
	short number;	// 2
	BYTE type;	// 4
	short index;	// 6
	int dis;	// 8
};

struct VIEWPORT_PLAYER_STRUCT
{
	char state;	// 0
	short number;	// 2
	BYTE type;	// 4
	short index;	// 6
	int dis;	// 8

};

struct MessageStateMachine
{
	int MsgCode;	// 0
	int SendUser;	// 4
	DWORD MsgTime;	// 8
	int SubCode;	// C

};

struct ExMessageStateMachine
{
	int MsgCode;	// 0
	int SendUser;	// 4
	DWORD MsgTime;	// 8
	int SubCode;	// C
	int SubCode2;	// 10
};

typedef struct tagSEND_MONSTER_ATTACK_MENSSAGE
{
	int iMsgCode;	// unk0
	int iIndex;	// unk4
	DWORD dwDelay;	// unk8
	int iSubCode;	// unkC
	int iSubCode2;	// unk10
}SEND_MONSTER_ATTACK_MENSSAGE;

extern ExMessageStateMachine gSMAttackProcMsg[OBJMAX][MAX_MONSTER_SEND_ATTACK_MSG];
extern MessageStateMachine gSMMsg[OBJMAX][MAX_MONSTER_SEND_MSG];

struct MONSTERKILLINFO
{
	int MonIndex;
	int KillCount;
};

struct BUFF_MANAGER
{
	BYTE btBuffIndex; //210
	BYTE btVpIndex; //211
	BYTE btEffectType1; //212
	BYTE btEffectType2; //213
	int iValue1; //214
	int iValue2; //218
	DWORD dwBuffTickCount; //21C
	int iDuration; //220
};

struct ML_PassiveSkill //S4 Updated
{
	int m_iML_IncreaseAttackSuccessRate; //4C8
	int m_iML_AttackRate; //4CC
	int m_iML_IncreasePvPDefenceRate; //4D0
	int m_iML_DurationReduction1; //4D4
	BYTE m_btML_DurationReduction1; //4D8
	int m_iML_DurationReduction2; //4DC
	int m_iML_ResistanceIncrease_Poison; //4E0
	int m_iML_ResistanceIncrease_Lightning; //4E4
	int m_iML_ResistanceIncrease_Ice; //4E8
	int m_iML_HPAutoIncrement; //4EC
	int m_iML_ZenIncrease; //4F0
	int m_iML_DefenseIncrease; //4F4
	int m_iML_MaximumLifeIncrease; //4F8
	int m_iML_MaximumAGIncrease; //4FC
	int m_iML_MonsterAttackManaIncrement; //500
	int m_iML_MonsterAttackLifeIncrement; //504
	int m_iML_MonsterAttackSDIncrement; //508
	int m_iML_IncreaseExpRate; //50C

	//Season 4 Add-on
	int m_iML_IncreaseMaxSD; //510
	int m_iML_IncreaseSDRecovery; //514
	int m_iML_IncreaseMaxDamage; //518
	int m_iML_IncreaseMinDamage; //51C
	int m_iML_IncreaseManaReduction; //520
	int m_iML_IncreaseMaxWizardry; //524
	int m_iML_IncreaseMinWizardry; //528
	int m_iML_DecreasePetDurReduction; //52C
	int m_iML_IncreaseMaxDmgWzdry; //530
	int m_iML_IncreaseMinDmgWzdry; //534
};

//size 2238 for GS-CS
struct OBJECTSTRUCT
{
	int		m_Index;

	int		Connected;

	char	LoginMsgSnd;
	char	LoginMsgCount;

	char	CloseCount;
	char	CloseType;

	BOOL	bEnableDelCharacter;

	struct	_PER_SOCKET_CONTEXT* PerSocketContext;
	SOCKET	m_socket;
	char	Ip_addr[16];

	int		UserNumber;
	int		DBNumber;

	DWORD	ukn_30; //

	BYTE	Magumsa;

	DWORD	AutoSaveTime;

	DWORD	ConnectCheckTime;

	DWORD	CheckTick;
	BYTE	CheckSpeedHack;
	DWORD	CheckTick2;
	BYTE	CheckTickCount;

	DWORD	SaveTimeForStatics;

	int		iPingTime;
	BYTE	m_TimeCount;

	DWORD	m_dwPKTimer;

	short	CheckSumTableNum;
	DWORD	CheckSumTime;

	WORD	Type;

	BYTE	Live;

	char	CharacterPos;

	char	AccountID[11];
	char	Name[11];

	char	LastJoominNumber[14];

	bool	PlusStatQuestClear;
	bool	ComboSkillquestClear;
	struct	ComboSkillData comboSkill;

	WORD	Class;
	BYTE	DbClass;
	
	BYTE	ChangeUP;
	BYTE	ChangeUP3rd;
	
	short	Level;
	int		LevelUpPoint;
	int		iFruitPoint;

	DWORD	Experience;
	DWORD	NextExp;

	short	MLevel;
	__int64 MLExp;
	__int64 MLNextExp;
	int		MLPoint;
	int		MLInfoLoad;

	int		Money;

#ifdef _32K_STATS_
	short	Strength;	//short
	short	Dexterity;	//short
	short	Vitality;	//short
	short	Energy;		//short
#else
	unsigned short	Strength;	//short
	unsigned short	Dexterity;	//short
	unsigned short	Vitality;	//short
	unsigned short	Energy;		//short
#endif

	float	Life;
	float	MaxLife;

	int		m_iScriptMaxLife;

	float	FillLife;
	float	FillLifeMax;

	float	Mana;
	float	MaxMana;

	WORD	Leadership;
	WORD	AddLeadership;

	WORD	ChatLitmitTime;
	BYTE	ChatLimitTimeSec;

	BYTE	FillLifeCount;

	short	AddStrength;
	short	AddDexterity;
	short	AddVitality;
	short	AddEnergy;

	int		BP;
	int		MaxBP;
	int		AddBP;

	float	VitalityToLife;
	float	EnergyToMana;

	char	m_PK_Count;
	char	m_PK_Level;
	int		m_PK_Time;

	short	X;
	short	Y;
	BYTE	Dir;
	BYTE	MapNumber;

	int		AddLife;
	int		AddMana;

	int		iShield;
	int		iMaxShield;
	int		iAddShield;
	int		iFillShieldMax;
	int		iFillShield;
	int		iFillShieldCount;
	DWORD	dwShieldAutoRefillTimer;

	BYTE	DamageMinus;
	BYTE	DamageReflect;
	short	MonsterDieGetMoney;
	BYTE	MonsterDieGetLife;
	BYTE	MonsterDieGetMana;

	BYTE	StartX;
	BYTE	StartY;
	short	m_OldX;
	short	m_OldY;

	short	TX;
	short	TY;
	short	MTX;
	short	MTY;

	int		PathCount;
	int		PathCur;
	char	PathStartEnd;
	short	PathOri[15];
	short	PathX[15];
	short	PathY[15];
	char	PathDir[15];
	DWORD	PathTime;

	BYTE	m_MoveGateNumber;

	//GS	90
	short	m_wRaiseTalismanSaveX;
	short	m_wRaiseTalismanSaveY;
	short	m_wRaiseTalismanSaveMap;
	short	m_wTeleportTalismanSaveX;
	short	m_wTeleportTalismanSaveY;
	short	m_wTeleportTalismanSaveMap;

	DWORD	Authority;
	DWORD	Penalty;
	BYTE	m_cAccountItemBlock;

	struct	tagActionState m_ActState;
	BYTE	m_ActionNumber;
	
	DWORD	m_State;
	char	m_StateSub;
	BYTE	m_Rest;

	char	m_ViewState;
	BYTE	m_btViewStateCount;
	struct	BUFF_MANAGER m_BuffEffectState[MAX_STATE_COUNT];

	DWORD	m_LastMoveTime;
	DWORD	m_LastAttackTime;

	BYTE	m_FriendServerOnline;

	int		m_DetectSpeedHackTime;
	DWORD	m_SumLastAttackTime;
	DWORD	m_DetectCount;
	int		m_DetectedHackKickCount;
	int		m_SpeedHackPenalty;
	BYTE	m_AttackSpeedHackDetectedCount;
	DWORD	m_PacketCheckTime;

	BYTE	m_ShopTime;

	DWORD	m_TotalAttackTime;
	int		m_TotalAttackCount;

	DWORD	TeleportTime;
	char	Teleport;

	char	KillerType;

	char	DieRegen;
	char	RegenOk;
	BYTE	RegenMapNumber;
	BYTE	RegenMapX;
	BYTE	RegenMapY;
	DWORD	RegenTime;
	DWORD	MaxRegenTime;

	short	m_PosNum;

	DWORD	LifeRefillTimer;

	DWORD	CurActionTime;
	DWORD	NextActionTime;
	DWORD	DelayActionTime;
	char	DelayLevel;

	char	m_PoisonType;
	char	m_IceType;

	//#unused ??
	char	m_iMonsterStunDelay; //0x39F unused
	char	m_iMonsterSleepDelay; //0x3A0 unused

	char	m_iMonsterBattleDelay;

	char	m_cKalimaGateExist;
	int		m_iKalimaGateIndex;
	char	m_cKalimaGateEnterCount;

	struct	OBJECTSTRUCT* lpAttackObj;

	short	m_SkillNumber;
	DWORD	m_SkillTime;

	bool	m_bAttackerKilled;

	char	m_ManaFillCount;
	char	m_LifeFillCount;

	int		SelfDefense[7];
	DWORD	SelfDefenseTime[7];
	DWORD	MySelfDefenseTime;

	char	m_Drink;

	int		m_SkillAttack;
	char	m_SkillAttackTime;

	int		PartyNumber;
	int		PartyTargetUser;

	int		GuildNumber;
	struct	_GUILD_INFO_STRUCT* lpGuild;
	char	GuildName[11];
	int		GuildStatus;
	int		iGuildUnionTimeStamp;

	int		m_RecallMon;
	int		m_Change;

	short	TargetNumber;
	short	TargetShopNumber;
	short	ShopNumber;

	short	LastAttackerID;

	int		m_AttackDamageMin;
	int		m_AttackDamageMax;
	int		m_MagicDamageMin;
	int		m_MagicDamageMax;
	int		m_AttackDamageLeft;
	int		m_AttackDamageRight;
	int		m_AttackDamageMaxLeft;
	int		m_AttackDamageMinLeft;
	int		m_AttackDamageMaxRight;
	int		m_AttackDamageMinRight;
	int		m_AttackRating;
	int		m_AttackSpeed;
	int		m_MagicSpeed;
	int		m_Defense;
	int		m_MagicDefense;
	int		m_SuccessfulBlocking;

	int		m_iSummonerBookSpell;
	int		m_iSummonerBookSpellDamageMin;
	int		m_iSummonerBookSpellDamageMax;

	short	m_MoveSpeed;
	short	m_MoveRange;
	short	m_AttackRange;
	short	m_AttackType;
	short	m_ViewRange;
	short	m_Attribute;
	short	m_ItemRate;
	short	m_MoneyRate;
	int		m_CriticalDamage;
	int		m_ExcelentDamage;

	class	CMagicInf* m_lpMagicBack;
	class	CMagicInf* Magic;

	char	MagicCount;
	BYTE	UseMagicNumber;
	DWORD	UseMagicTime;
	char	UseMagicCount;
	short	OSAttackSerial;
	BYTE	SASCount;

	DWORD	SkillAttackTime;
			
	struct	ML_PassiveSkill m_MLPassiveSkill; //Season 4 Master Skill System Updated

	int		m_iSoulBarrierDefense; //Season 3 BuffEffect for Soul Barrier Skill
	short	m_sSoulBarrierDuration; //Season 3 BuffEffect for Soul Barrier Skill

	BYTE	CharSet[18];

	char	m_Resistance[MAX_RESISTENCE_TYPE];
	char	m_AddResistance[MAX_RESISTENCE_TYPE];

	int		FrustrumX[4];
	int		FrustrumY[4];

	struct	VIEWPORT_STRUCT VpPlayer[MAX_VIEWPORT];
	struct	VIEWPORT_PLAYER_STRUCT VpPlayer2[MAX_VIEWPORT];

	int		VPCount;
	int		VPCount2;

	struct	HITDAMAGE_STRUCT sHD[MAX_ST_HIT_DAMAGE];
	short	sHDCount;

	struct	tagInterfaceState m_IfState;
	DWORD	m_InterfaceTime;

	class	CItem* pInventory;
	LPBYTE	pInventoryMap;
	char*	pInventoryCount;
	char	pTransaction;

	class	CItem* Inventory1;
	LPBYTE	InventoryMap1;
	char	InventoryCount1;
	class	CItem* Inventory2;
	LPBYTE	InventoryMap2;
	char	InventoryCount2;

	class	CItem* Trade;
	LPBYTE	TradeMap;
	int		TradeMoney;
	bool	TradeOk;

	class	CItem* pWarehouse;
	LPBYTE	pWarehouseMap;
	char	WarehouseCount;
	short	WarehousePW;
	BYTE	WarehouseLock;
	BYTE	WarehouseUnfailLock;
	int		WarehouseMoney;
	int		WarehouseSave;

	class	CItem* pChaosBox;
	LPBYTE	pChaosBoxMap;

	int		ChaosMoney;
	int		ChaosSuccessRate;
	BOOL	ChaosLock;

	DWORD	m_Option;

	int		m_nEventScore;
	int		m_nEventExp;
	int		m_nEventMoney;

	BYTE	m_bDevilSquareIndex;
	bool	m_bDevilSquareAuth;

	char	m_cBloodCastleIndex;
	char	m_cBloodCastleSubIndex;
	int		m_iBloodCastleEXP;
	bool	m_bBloodCastleComplete;

	char	m_cChaosCastleIndex;
	char	m_cChaosCastleSubIndex;
	int		m_iChaosCastleBlowTime;
	char	m_cKillUserCount;
	char	m_cKillMonsterCount;

	int		m_iDuelUserReserved;
	int		m_iDuelUserRequested;
	int		m_iDuelUser;
	BYTE	m_btDuelScore;
	int		m_iDuelTickCount;

	bool	m_bPShopOpen;
	bool	m_bPShopTransaction;
	bool	m_bPShopItemChange;
	bool	m_bPShopRedrawAbs;
	char	m_szPShopText[36];
	bool	m_bPShopWantDeal;
	int		m_iPShopDealerIndex;
	char	m_szPShopDealerName[10];
	struct	_RTL_CRITICAL_SECTION m_critPShopTrade;
	int		m_iVpPShopPlayer[MAX_VIEWPORT];
	WORD	m_wVpPShopPlayerCount;

	bool	IsInBattleGround;

	bool	HaveWeaponInHand;

	short	EventChipCount;
	int		MutoNumber;
	BOOL	UseEventServer;

	bool	LoadWareHouseInfo;

	int		iStoneCount;

	int		m_i3rdQuestState;
	int		m_i3rdQuestIndex;
	MONSTERKILLINFO MonsterKillInfo[5];

	BYTE	m_Quest[50];
	bool	m_SendQuestInfo;

	int		m_SkyBossMonSheildLinkIndex;
	int		m_SkyBossMonSheild;
	int		m_SkyBossMonSheildTime;

	int		m_MaxLifePower;

	int		m_PacketChecksumTime;
	int		m_CheckLifeTime;

	BYTE	m_MoveOtherServer;

	char	BackName[11];

	char	m_BossGoldDerconMapNumber;

	bool	m_InWebzen;

	char	m_LastTeleportTime;

	BYTE	m_ClientHackLogCount;

	BOOL	m_bIsInMonsterHerd;
	BOOL	m_bIsMonsterAttackFirst;
	class	MonsterHerd* m_lpMonsterHerd;

	//Exclude CHS version
	class	CCSAuth2 NPggCSAuth;
	bool	m_bSentGGAuth;
	DWORD	m_NPggCheckSumSendTime;

	int		fSkillFrustrumX[4];
	int		fSkillFrustrumY[4];

	BYTE	SkillHellFire2State;
	BYTE	SkillHellFire2Count;
	DWORD	SkillHellFire2Time;

	BYTE	m_ReqWarehouseOpen;

	int		m_NotAttackAreaCount;

	short	SetOpAddSkillAttack;
	short	SetOpAddExDamage;
	short	SetOpAddExDamageSuccessRate;
	short	SetOpAddCriticalDamage;
	short	SetOpAddCriticalDamageSuccessRate;
	short	SetOpIncAGValue;
	short	SetOpAddDamage;
	short	SetOpAddMinAttackDamage;
	short	SetOpAddMaxAttackDamage;
	short	SetOpAddAttackDamage;
	short	SetOpAddDefence;
	short	SetOpAddDefenceRate;
	short	SetOpAddMagicPower;

	BYTE	SetOpIgnoreDefense;
	BYTE	SetOpDoubleDamage;
	BYTE	SetOpTwoHandSwordImproveDamage;
	BYTE	SetOpImproveSuccessAttackRate;
	BYTE	SetOpReflectionDamage;
	BYTE	SetOpImproveSheldDefence;
	BYTE	SetOpDecreaseAG;
	BYTE	SetOpImproveItemDropRate;

	bool	IsFullSetItem;

	class	TDurMagicKeyChecker DurMagicKeyChecker;

	WORD	SkillRecallParty_Time;
	BYTE	SkillRecallParty_MapNumber;
	BYTE	SkillRecallParty_X;
	BYTE	SkillRecallParty_Y;

	bool	bIsChaosMixCompleted;

	bool	SkillLongSpearChange;

	class	CSkillDelay SkillDelay;

	int		iObjectSecTimer;

	bool	m_bMapSvrMoveQuit;
	bool	m_bMapSvrMoveReq;
	DWORD	m_dwMapSvrQuitTick;
	short	m_sPrevMapSvrCode;
	short	m_sDestMapNumber;

	BYTE	m_btDestX;
	BYTE	m_btDestY;

	union
	{
		struct
		{
				BYTE	m_btCsNpcExistVal1;
				BYTE	m_btCsNpcExistVal2;
				BYTE	m_btCsNpcExistVal3;
				BYTE	m_btCsNpcExistVal4;
		};
		int		m_iCsNpcExistVal;
	};

	BYTE	m_btCsNpcType;

	BYTE	m_btCsGateOpen;

	int		m_iCsGateLeverLinkIndex;

	BYTE	m_btCsNpcDfLevel;
	BYTE	m_btCsNpcRgLevel;

	BYTE	m_btCsJoinSide;
	bool	m_bCsGuildInvolved;

	bool	m_bIsCastleNPCUpgradeCompleted;

	BYTE	m_btWeaponState;
	int		m_iWeaponUser;

	BYTE	m_btKillCount;

	int		m_iAccumulatedDamage;

	BYTE	m_btLifeStoneCount;
	BYTE	m_btCreationState;
	int		m_iCreatedActivationTime;

	int		m_iAccumulatedCrownAccessTime;

	class	TMonsterSkillElementInfo m_MonsterSkillElementInfo;

	int		m_iBasicAI;
	int		m_iCurrentAI;
	int		m_iCurrentAIState;
	int		m_iLastAIRunTime;
	int		m_iGroupNumber;
	int		m_iSubGroupNumber;
	int		m_iGroupMemberGuid;
	int		m_iRegenType;
	class	TMonsterAIAgro m_Agro;
	int		m_iLastAutomataRuntime;
	int		m_iLastAutomataDelay;

	int		m_iCrywolfMVPScore;

	int		m_iPcBangRoom;	//2030 (new) confirmed thru illusion

	DWORD	m_dwLastCheckTick;

	int		m_iAutoRecuperationTime;

	int		m_iSkillDistanceErrorCount;
	DWORD	m_dwSkillDistanceErrorTick;

	struct	JEWELOFHARMONY_ITEM_EFFECT m_JewelOfHarmonyEffect;
	struct	ITEMOPTION_FOR380ITEM_EFFECT m_ItemOptionExFor380;

	BOOL	m_bKanturuEntranceByNPC;

	WORD	m_wItemEffectType;
	int		m_iItemEffectValidTime;

	int	m_wCashPoint; //0x209C

	//PcBang Variables #START#

	//PcBang EventServer Control
	int		m_iPcBangConnectionType; // 0x20A0

	//PcBang
	PCBANG_POINT_SYSTEM	m_PcBangPointSystem; // 0x20A4

	//PcBang Class Timer
	CPCBangPointTimer	m_PCBangPointTimer; //0x20C4

	//PcBang Variables #END#

	int		m_iIllusionTempleIndex; //20FC
	BOOL	m_bSkillKeyRecv; //0x2100
	int		m_iPeriodItemEffectIndex; //0x2104
	BYTE	Summoner; //0x2108

	//Season4 add-on size 0x108
	SOCKET_ITEM			m_SocketSet[35];  //0x210A
	SOCKET_ITEM			m_SocketWeapon[7];  //0x21DC
	SOCKET_ITEM			m_SocketBonus[2];  //0x2206

	///////////////////
	WORD	m_wSocketOpIncLifePower; //0x2212
	WORD	m_wSocketOpIncMaxMana; //0x2214
	WORD	m_wSocketOpAddLife; //0x2216
	WORD	m_wSocketOpAddMana; //0x2218
	BYTE	m_btSocketOpDecreaseAG; //0x221A
	///////////////////

	class CHackToolPacket		m_HackToolCheck; //0x221C

	BYTE	m_btSummonedbyGM; //0x2234
	//Season 4.6
	int m_iDuelRoom;
	bool m_DuleFix;
	int ExCred;
	BYTE MultiVault;
#ifdef _RECONNECT_
	bool m_ConnectEx;
	int  DisconnectType;
#endif
//#if(_JEWELS_BANK_)
	int ChaosBank;
	int BlessBank;
	int SoulBank;
	int LifeBank;
//#endif
	int OffTrade;

	DWORD MTDate;

#if(DEV_COMBO_CUSTOM==TRUE)
	bool NewCombo;
#endif
};

typedef OBJECTSTRUCT * LPOBJ;

////////////////////////////
//	Ex-Team User Struct	  //
////////////////////////////
struct Ex_User
{
	int PCPoint;
	int Reset;
	int GReset;
	int OffTrade;
	int ExFreePoints;
	int ExQuestNum;
	int ExQuestKill;
	int OffExp;
	int OffExpTick;
	int OffExpSpeed;
	int OffExpWcoinTick;
	int OffExpBuff;
	int PCPointTick;
//#ifdef PREMIUM_SYSTEM
	int PremiumTime;
//#endif
//#if __ExGames__
	int ChatBanTime;
//#endif
//#if __MuRain__
	int NoobTime;
//#endif
//#ifdef _MuReal_
	int OffAfk;
	int VipTime;
	int CR;
	int WCoinTick;
//#endif
	//Quest System
	int BMQuest_num;
	int BMQuest_kill;
	int BMQuest_start;
